Autodesk.Revit.DB.Level.FindAssociatedPlanViewId
Finds the id of the first available associated floor or structural plan view associated with this level.
Remarks:
The view id returned is determined by the same rules associated with the Revit tool "Go to Floor Plan".
Many levels may actually have more than one associated floor plan id and this routine will only return
the first one found. If no associated view is found, InvalidElementId is returned.
Since:
2018

Autodesk.Revit.DB.Level.GetPlaneReference
Returns a reference to this element as a plane.
Since:
2016

Autodesk.Revit.DB.Level.Create(Autodesk.Revit.DB.Document,System.Double)
Creates a new instance of level based on an input elevation.
document:
The document in which the new instance is created
elevation:
The elevation of the level to be created.
Returns:
The newly created level instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Level.ProjectElevation
Retrieves the elevation relative to project origin, no matter
what values of the Elevation Base parameter is set.
Remarks:
This read only property returns the elevation relative to
project origin.

Autodesk.Revit.DB.Level.Elevation
Retrieves or changes the elevation above or below the ground level.
Remarks:
This property retrieves or changes the elevation above or below the ground level of the
project. If the Elevation Base parameter is set to Project, the elevation is relative to project origin.
If the Elevation Base parameter is set to Shared, the elevation is relative to shared origin which can
be changed by relocate operation. The value is given in decimal feet.

Autodesk.Revit.DB.Level
Represents a Level within Autodesk Revit.
Remarks:
A Level is conceptually a horizontal rectangle of finite extents. It appears as a straight line in views that intersect
the rectangle. The straight line represents the projection of the rectangle onto the view.
The Name property can be used to retrieve the user visible name of the level that appears in the level bubble.